//------------------------------------
//		include
//------------------------------------
#include "AnimObject.h"

//<><><><><><><><><><><><><><><><><><>
// 関数名： AnimObject
// 役割：コンストラクタ
//<><><><><><><><><><><><><><><><><><>
AnimObject::AnimObject(XMFLOAT3& _Camera)
{
	mAnimObject = new AnimSprite(_Camera);
	mSprite = mAnimObject;					

	// このクラスを継承するときのデフォルトサイズ
	mSprite->mSize.x = 0.3f;
	mSprite->mSize.y = 0.3f;

	mHit = new HitCircle(&mAnimObject->mCenter,0.1f);
	
}

//<><><><><><><><><><><><><><><><><><>
// 関数名： ~AnimObject
// 役割：デストラクタ
//<><><><><><><><><><><><><><><><><><>
AnimObject::~AnimObject()
{
	delete mAnimObject;
	delete mHit;
}


//======================================================================================
// 担当者：		菅眞心
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================