//======================================================================================
// 名前：AnimObject.h
// 説明：動くオブジェクト
//======================================================================================
#pragma once
#include "GameObject.h"
#include "AnimSprite.h"
#include "HitCircle.h"
#include "Sound.h"

class AnimObject :
	public GameObject
{
private:
	
public:
	// 表示機能
	AnimSprite* mAnimObject;
	HitCircle* mHit;

	AnimObject(XMFLOAT3& _Camera);	//コンストラクタ
	~AnimObject();	//デストラクタ

};

//======================================================================================
// 担当者：		菅眞心
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================