//======================================================================================
//	名前：AnimSprite.h
//  説明：動くスプライト
//======================================================================================
#pragma once
#include "Sprite.h"

//移動方向
enum DIRECTION
{
	D_DOWN, D_LEFT, D_RIGHT, D_UP
};

class AnimSprite :
	public Sprite
{
private:
	
public:
	
	static constexpr int nAnimTable[] = { 0,1,2,1,-1 };		//アニメーションテーブル
	DIRECTION mDirection = D_LEFT;							//キャラの向き
	float fAnimSpeed = 0.001f;								//アニメーション速度
	float fAnimCnt = 0.0f;									//アニメーション計算用

	void Update() override;			//更新
	AnimSprite(XMFLOAT3& _Camera);	//基底コンストラクタを呼び出す
};


//======================================================================================
// 担当者：		菅眞心
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================