#pragma once
//======================================================================================
// 名前：GameObject.h
// 説明：ゲームオブジェクトの表示
//======================================================================================

//------------------------------------
//		include
//------------------------------------
#include "Sprite.h"

class GameObject
{

public:
	// 表示機能
	Sprite* mSprite;

	virtual void Update();
	void Draw();

	// 表示/非表示を切り替える変数
	bool active = true;

	virtual void SetActive(bool state); // activeに値をセットする関数

	// サイズを設定する関数
	void SetSize(float x, float y);
	// 位置を設定する関数
	void SetPosition(float x, float y);

};


//======================================================================================
// 担当者：		井上想哉
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================
