//------------------------------------
//		include
//------------------------------------
#include "GameObject.h"


//<><><><><><><><><><><><><><><><><><>
// 関数名： Update
// 役割：更新
//<><><><><><><><><><><><><><><><><><>
void GameObject::Update()
{
	mSprite->Update();
}

//<><><><><><><><><><><><><><><><><><>
// 関数名：Draw
// 役割：描画
// 引数：なし
// 戻り値：なし
//<><><><><><><><><><><><><><><><><><>
void GameObject::Draw()
{
	if (active == true)
	{
		mSprite->Draw();
	}
}

//<><><><><><><><><><><><><><><><><><>
// 関数名：SetActive
// 役割：Objectの表示非表示
// 引数：状態
// 戻り値：なし
//<><><><><><><><><><><><><><><><><><>
void GameObject::SetActive(bool state)
{
	active = state;
}

//<><><><><><><><><><><><><><><><><><>
// 関数名：SetSize
// 役割：オブジェクトのサイズセッター
// 引数：サイズ
// 戻り値：なし
//<><><><><><><><><><><><><><><><><><>
void GameObject::SetSize(float x, float y)
{
	mSprite->mSize.x = x;
	mSprite->mSize.y = y;

}

//<><><><><><><><><><><><><><><><><><>
// 関数名：SetPosition
// 役割：オブジェクトの座標セッター
// 引数：座標
// 戻り値：なし
//<><><><><><><><><><><><><><><><><><>
void GameObject::SetPosition(float x, float y)
{
	mSprite->mCenter.x = x;
	mSprite->mCenter.y = y;
}

//======================================================================================
// 担当者：		井上想哉
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================