//======================================================================================
// 名前：HitCircle.h
// 説明：円の当たり判定クラス
//======================================================================================
#pragma once

//------------------------------------
//		include
//------------------------------------

#include<DirectXMath.h>
using namespace DirectX;

#include "HitSquare.h"

//------------------------------------
//		クラス
//------------------------------------

class HitCircle
{
public:
	XMFLOAT2* mPos;	//座標
	float mRadius;	//半径
	bool active;	// on / off

	HitCircle(XMFLOAT2 *);// コンストラクタ
	HitCircle(XMFLOAT2 *, float);// コンストラクタ
	bool CheckHit(HitCircle* _circle);// あたり判定（円と円）
	bool CheckHit(HitSquare* _square);// あたり判定（円と四角）
};


//======================================================================================
// 担当者：		中川直登
// 制作日時：　 2022-12-08
// チーム名：	黒棺	
//======================================================================================