//======================================================================================
// 名前：HitSquare.h
// 説明：四角の当たり判定クラス
//======================================================================================
#pragma once

//------------------------------------
//		include
//------------------------------------

#include<DirectXMath.h>
using namespace DirectX;

#define PI 3.14159f

//------------------------------------
//		クラス
//------------------------------------

class HitSquare
{
public:
	XMFLOAT2* mPos;	//座標
	XMFLOAT2 mSize;//サイズ
	XMFLOAT2 mGap;	//参照した座標からのずれ
	float mAngle;	//半径
	float mDiagonal;// 対角線の長さ（半分）
	float mDiagonalAng;// 対角線の角度
	bool active;	// on / off

	HitSquare(XMFLOAT2*);
	HitSquare(XMFLOAT2*, XMFLOAT2, XMFLOAT2, float);

	bool CheckHit(HitSquare*);// あたり判定（四角と四角）
};


//======================================================================================
// 担当者：		中川直登
// 制作日時：　 2022-12-08
// チーム名：	黒棺	
//======================================================================================