//======================================================================================
// 名前：SlipperyFloor.h
// 説明：ぴかぴかの床のヘッダーファイル
//======================================================================================
#pragma once

//------------------------------------
//		include
//------------------------------------

#include "AnimObject.h"
#include "HitSquare.h"

#define MAP_WIDTH 2.8f
#define MAP_HIGHT 2.0f

//------------------------------------
//		クラス
//------------------------------------

class SlipperyFloor :
	public AnimObject
{
private:
	//ID3D11ShaderResourceView* mTexture;			// ぴかぴか床のテクスチャ※たくさん要らない
	float mlimitTime;// 消滅時間
	float mTime;// 経過時間
public:
	HitSquare* mSquare;// あたり判定

	SlipperyFloor(XMFLOAT3 &);// コンストラクタ
	~SlipperyFloor();// デストラクタ

	void Update()override;// 更新処理
	void SetLimitTime(float);// 制限時間設定兼アクティブ化
};

//======================================================================================
// 担当者：		中川直登
// チーム名：	黒棺	
//======================================================================================