//======================================================================================
// 名前：StaticObject
// 説明：動かないオブジェクト
//======================================================================================
#pragma once

#include "GameObject.h"
#include "HitCircle.h"


class StaticObject :
	public GameObject
{
private:

public:

	//HitSquare* mHit;	//あたり判定

	StaticObject(XMFLOAT3& _Camera);		//コンストラクタ
	~StaticObject();	//デストラクタ
};

//======================================================================================
// 担当者：		菅眞心
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================
