//------------------------------------
//		include
//------------------------------------
#include "StaticObject.h"

//<><><><><><><><><><><><><><><><><><>
// 関数名： コンストラクタ
// 役割：初期化
//<><><><><><><><><><><><><><><><><><>
StaticObject::StaticObject(XMFLOAT3& _Camera)
{
	// アニメーションなし表示機能を作成
	mSprite = new Sprite(_Camera);
	//mHit = new HitSquare(&mSprite->mCenter);

}

//<><><><><><><><><><><><><><><><><><>
// 関数名：デストラクタ
// 役割：メモリ解放
//<><><><><><><><><><><><><><><><><><>
StaticObject::~StaticObject()
{
	delete mSprite;
}

//======================================================================================
// 担当者：		菅眞心
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================