//======================================================================================
// 名前：System.h
// 説明：ゲームシステム
//======================================================================================
#pragma once
#include"StaticObject.h"
#include <time.h>
#include <Windows.h>
#include "Sound.h"
#pragma comment (lib, "winmm.lib")

void System_Init(void);										//初期化
void System_Update(void);									//更新
void GameSound_Init(void);
void GameSound_Uninit(void);


//======================================================================================
// 担当者：		菅眞心
// 制作日時：　 2022-12-01
// チーム名：	黒棺	
//======================================================================================

